---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.CADLink
source: html/22c6ad44-6904-66ac-9d70-c690e75b4410.htm
---
# Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.CADLink Property

An external resource type representing CAD Links data.

## Syntax (C#)
```csharp
public static ExternalResourceType CADLink { get; }
```